/*
无参数无返回值的函数
*/

//#include<stdint.h>
//#include<stdlib.h>
//
//int main(void)
//{
//	/*
//	
//	函数的四种类型：
//		1.无参数、无返回值
//			void fun()
//			{
//				NO return;
//			}
//
//		2.无参数、有返回值
//			void fun()
//			{
//				return int;
//			{
//
//		3.有参数、无返回值
//			int(eg) fun()
//			{
//				NO return;
//			}
//
//		4.有参数、有返回值
//			int(eg) fun()
//			{
//				return int;
//			}
//
//	函数声明（函数头）拆解：
//		void fun(void)
//		1.第一个void处：函数的返回值，也是函数的类型，void为无返回值，如果使用其他类型的变量，则会返回对应类型的数值
//
//		2.fun：此处为函数的名称，一般定义时采用与功能相关的较为详细的函数名称
//			注：可以使用字母以及下划线开头、不可以使用C语言本身的函数或者关键词进行定义、
//
//		3.第二个括号内void处：此处为函数的参数列表，代表着从函数调用处传递了几个参数给本函数
//
//	*/
//
//
//	system("pause");
//	return 0;
//}