/*
递归函数的展开
*/

//#include<stdio.h>
//#include<stdlib.h>
//
//void Fun1(int a);
//
//int main(void)
//{
//	/*
//	
//	对一个简单的递归函数进行代码逻辑上的展开
//	*/
//
//	Fun1(5);
//	/*
//	递归的展开：
//
//	void Fun1(5)	//第一层递归，此时5大于0，递归开始执行，开始向内执行代码
//	{
//
//		if (a > 0)
//		{
//			printf("a = %d\n", a); //#1，打印5
//			void Fun1(4)	//第二层递归
//			{
//
//				if (a > 0)
//				{
//					printf("a = %d\n", a);//#2，打印4
//					void Fun1(3)	//第三层递归
//					{
//
//						if (a > 0)
//						{
//							printf("a = %d\n", a);//#3，打印3
//							void Fun1(2)	//第四层递归
//							{
//
//								if (a > 0)
//								{
//									printf("a = %d\n", a);//#4，打印2
//									void Fun1(1)	//第五层递归（最内层递归）
//									{
//
//										if (a > 0)
//										{
//											printf("a = %d\n", a);//#5，打印1
//											Fun1(a - 1); //代码继续执行，此时0并不小于0，因此递归结束，开始向外执行代码
//
//											printf("a = %d\n", a);//#5，打印1
//										}
//									}
//
//									printf("a = %d\n", a);//#4，打印2
//								}
//							}
//
//							printf("a = %d\n", a);//#3，打印3
//						}
//					}
//
//					printf("a = %d\n", a);//#2，打印4
//				}
//			}
//
//			printf("a = %d\n", a);//#1，打印5
//		}
//	}
//	*/
//
//	system("pause");
//	return 0;
//}
//
//void Fun1(int a)
//{
//
//	if (a > 0)
//	{
//		printf("a = %d\n", a);
//		Fun1(a - 1);
//
//		printf("a = %d\n", a);//通过对递归函数的展开来分析此语句打印的内容
//	}
//}