/*
字符的介绍
*/

//#include<stdio.h>
//#include<stdlib.h>
//
//int main(void)
//{
//	/*
//	
//	基本数据类型：
//		1.数值类型
//			整形与浮点型数值
//
//		2.字符类型
//			字符与字符串类型
//
//	字符的分类（大体三类，并不唯一）：
//		1.asc2码字符（ASCII）
//			ASCII码表
//
//		2.拓展asc2码字符
//			制表符
//
//		3.宽字符
//			汉字、特殊字符等
//
//	*/
//
//	//打印一个A
//	printf("%c\n", 'A');
//	/*
//	
//	使用%c来打印字符（多于一个的字符被称为字符串，不能使用%c来进行打印）
//
//	对A进行打印的时候，要将A写在' '中
//	*/
//
//	putchar('A');
//	putchar('\n');
//	/*
//	
//	字符的另一个输出方式，使用putchar函数，直接使用单引号将要输出的字符填入即可
//	*/
//
//
//	system("pause");
//	return 0;
//}