/*
随机数应用
*/

//#include"2.14.0Common.h"
//#include<time.h>
//
//int main(void)
//{
//	/*
//	
//	Srand注意点：
//		如果不书写srand或者不添加随机数种子，在使用rand产生随机数的时候，就默认随机数种子为1
//
//	随机产生指定范围的一个数：
//		1.产生0~78的随机数：
//			rand()%79;
//			对产生的随机数求余，这样得到的数，最大就是78
//		2.产生100~999的随机数：
//			先产生0~899的随机数
//			所有随机数+100
//		3.产生50~120的随机数
//			先产生0~70的随机数
//			所有随机数+50
//
//	随机产生指定一组数中的一个：
//		将指定的一组数添加到一个数组中，这样即便数字不是连续的，但是数组的下标是连续的，此时再来产生对应个数的随机数
//	
//	*/
//	int i = 0;
//	//0~78范围内随机数
//	srand((unsigned int)time(NULL));
//	int a = 0;
//	while (i < 10)
//	{
//		a = rand() % 79;
//		printf("%d\n", a);
//		i++;
//	}
//	printf("\n");
//	//100~999范围内随机数
//	int b = 0;
//	i = 0;
//	while (i < 10)
//	{
//		b = rand() % 900 + 100;
//		printf("%d\n", b);
//		i++;
//	}
//	printf("\n");
//	//50~120范围内随机数
//	int c = 0;
//	i = 0;
//	while (i < 10)
//	{
//		b = rand() % 71 + 50;
//		printf("%d\n", b);
//		i++;
//	}
//	printf("\n");
//	//产生指定一组数中的随机数>12，8，352，65，7894，13，45，65，5，0
//	int d[10] = { 12,8,352,65,7894,13,45,65,5,0 };
//	int n = 0;
//	i = 0;
//	while (i < 10)
//	{
//		n = rand() % 10;
//		printf("%d\n", d[n]);
//		i++;
//	}
//	printf("\n");
//
//
//	system("pause");
//	return 0;
//}