/*
静态存储区与全局变量
*/

//#include<stdio.h>
//#include<stdlib.h>
//
//int a;
//int b[4];
//int* p;
//struct Code
//{
//	int a;
//	double d;
//}Str;
//
//int main(void)
//{
//	/*
//	
//	静态变量：
//		静态区/静态全局区/静态存储区
//			特点：
//				会被系统自动初始化为0，声明周期与程序共存亡，在运行的时候，会在加载资源阶段分配空间
//				（不管在何处定义，均会在加载资源阶段分配空间）
//
//			全局变量/外部变量：
//				书写在全局的位置，比如函数外
//				并且全局变量如果没有初始化，则会自动初始化为0
//				！注：当全局变量与局部变量名称重复时，在当前大括号范围内，局部变量生效
//
//			静态全局变量
//
//			静态局部变量
//
//			静态函数
//	
//	*/
//	printf("%d\n", a);
//	int a = 25;
//	printf("%d\n", a);
//
//	int i = 4;
//	for (i = 0; i < 4; i++)
//	{
//		printf("%d\n", b[i]);
//	}
//
//	printf("%p\n", &p);
//
//	printf("%d,%lf\n", Str.a, Str.d);
//
//
//	system("pause");
//	return 0;
//}